고객과 잘 맞는 타입 추천 :
basic1 데이터와 basic3 데이터를 basic1의 'f4'값을 기준으로 병합하고,
병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼 합을 구하시

basic1.csv: 고객 데이터
basic3.csv: 잘 어울리는 관계 데이터 (추천1:r1, 추천2:r2)

In [20]:
import pandas as pd
import numpy as np
customer = pd.read_csv('/Users/jochaeyeon/Downloads/basic1.csv')
customer.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [21]:
import pandas as pd
import numpy as np
relation = pd.read_csv('/Users/jochaeyeon/Downloads/basic3.csv')
relation.head()

     f4    r1    r2
0  INFP  ENFJ  ENTJ
1  ENFP  INFJ   NaN
2  INFJ  ENFP  ENTP
3  ENFJ  INFP  ISFP
4  INTJ  ENFP  ENTP

In [ ]:
df = pd.merge(customer, relation, on ="f4" , how ="inner")
df.head()

     id   age city    f1  f2   f3    f4         f5    r1    r2
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986  ESFP   NaN
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078  ENFJ  ENTJ
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869  ESFP  ESTP

In [23]:
df.shape

(100, 10)

In [24]:
df = df.dropna(subset=["r2"])

In [25]:
df.shape

(83, 10)

In [30]:
new_df = df.head(20)
new_df["f2"].sum()

15